zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca80/pic32cz2051ca80144-pinctrl.h
/* pb18a_eic_extint2 */
#define PB18A_EIC_EXTINT2 MCHP_PINMUX(b, 18, a, periph)

/* pb18b_adc0_ain6 */
#define PB18B_ADC0_AIN6 MCHP_PINMUX(b, 18, b, periph)

/* pb19_gpio */
#define PB19_GPIO MCHP_PINMUX(b, 19, gpio, gpio)

/* pb19a_eic_extint3 */
#define PB19A_EIC_EXTINT3 MCHP_PINMUX(b, 19, a, periph)

/* pb19b_adc0_ain7 */
#define PB19B_ADC0_AIN7 MCHP_PINMUX(b, 19, b, periph)

/* pb20_gpio */
#define PB20_GPIO MCHP_PINMUX(b, 20, gpio, gpio)

/* pb20a_eic_extint4 */
#define PB20A_EIC_EXTINT4 MCHP_PINMUX(b, 20, a, periph)

/* pb20b_adc0_ain8 */
#define PB20B_ADC0_AIN8 MCHP_PINMUX(b, 20, b, periph)

/* pb21_gpio */
#define PB21_GPIO MCHP_PINMUX(b, 21, gpio, gpio)

/* pb21a_eic_extint5 */
#define PB21A_EIC_EXTINT5 MCHP_PINMUX(b, 21, a, periph)

/* pb21p_ptc_drv17 */
#define PB21P_PTC_DRV17 MCHP_PINMUX(b, 21, p, periph)

/* pb22_gpio */
#define PB22_GPIO MCHP_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 MCHP_PINMUX(b, 22, a, periph)

/* pb22p_ptc_drv16 */
#define PB22P_PTC_DRV16 MCHP_PINMUX(b, 22, p, periph)

/* pb23_gpio */
#define PB23_GPIO MCHP_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 MCHP_PINMUX(b, 23, a, periph)

/* pb23p_ptc_drv15 */
#define PB23P_PTC_DRV15 MCHP_PINMUX(b, 23, p, periph)

/* pb24_gpio */
#define PB24_GPIO MCHP_PINMUX(b, 24, gpio, gpio)

/* pb24a_eic_extint8 */
#define PB24A_EIC_EXTINT8 MCHP_PINMUX(b, 24, a, periph)

/* pb24p_ptc_drv14 */
#define PB24P_PTC_DRV14 MCHP_PINMUX(b, 24, p, periph)

/* pb25_gpio */
#define PB25_GPIO MCHP_PINMUX(b, 25, gpio, gpio)

/* pb25a_eic_extint9 */
#define PB25A_EIC_EXTINT9 MCHP_PINMUX(b, 25, a, periph)

/* pb25p_ptc_drv13 */
#define PB25P_PTC_DRV13 MCHP_PINMUX(b, 25, p, periph)

/* pb26_gpio */
#define PB26_GPIO MCHP_PINMUX(b, 26, gpio, gpio)

/* pb26a_eic_extint10 */
#define PB26A_EIC_EXTINT10 MCHP_PINMUX(b, 26, a, periph)

/* pb26p_ptc_drv12 */
#define PB26P_PTC_DRV12 MCHP_PINMUX(b, 26, p, periph)

/* pc0_gpio */
#define PC0_GPIO MCHP_PINMUX(c, 0, gpio, gpio)

/* pc0a_eic_extint0 */
#define PC0A_EIC_EXTINT0 MCHP_PINMUX(c, 0, a, periph)

/* pc0d_sercom0_pad0 */
#define PC0D_SERCOM0_PAD0 MCHP_PINMUX(c, 0, d, periph)

/* pc0f_tcc0_wo0 */
#define PC0F_TCC0_WO0 MCHP_PINMUX(c, 0, f, periph)

/* pc0j_spi_ixs0_fsync */
#define PC0J_SPI_IXS0_FSYNC MCHP_PINMUX(c, 0, j, periph)

/* pc0m_gclk_io4 */
#define PC0M_GCLK_IO4 MCHP_PINMUX(c, 0, m, periph)

/* pc1_gpio */
#define PC1_GPIO MCHP_PINMUX(c, 1, gpio, gpio)

/* pc1a_eic_extint1 */
#define PC1A_EIC_EXTINT1 MCHP_PINMUX(c, 1, a, periph)

/* pc1d_sercom0_pad1 */
#define PC1D_SERCOM0_PAD1 MCHP_PINMUX(c, 1, d, periph)

/* pc1f_tcc0_wo1 */
#define PC1F_TCC0_WO1 MCHP_PINMUX(c, 1, f, periph)

/* pc1j_spi_ixs0_sck */
#define PC1J_SPI_IXS0_SCK MCHP_PINMUX(c, 1, j, periph)

/* pc1m_gclk_io5 */
#define PC1M_GCLK_IO5 MCHP_PINMUX(c, 1, m, periph)

/* pc2_gpio */
#define PC2_GPIO MCHP_PINMUX(c, 2, gpio, gpio)

/* pc2a_eic_extint1 */
#define PC2A_EIC_EXTINT1 MCHP_PINMUX(c, 2, a, periph)

/* pc2d_sercom0_pad2 */
#define PC2D_SERCOM0_PAD2 MCHP_PINMUX(c, 2, d, periph)

/* pc2f_tcc0_wo2 */
#define PC2F_TCC0_WO2 MCHP_PINMUX(c, 2, f, periph)

/* pc2j_spi_ixs0_sdi */
#define PC2J_SPI_IXS0_SDI MCHP_PINMUX(c, 2, j, periph)

/* pc2m_gclk_io6 */
#define PC2M_GCLK_IO6 MCHP_PINMUX(c, 2, m, periph)

/* pc2p_ptc_eci0 */
#define PC2P_PTC_ECI0 MCHP_PINMUX(c, 2, p, periph)

/* pc3_gpio */
#define PC3_GPIO MCHP_PINMUX(c, 3, gpio, gpio)

/* pc3a_eic_extint3 */
#define PC3A_EIC_EXTINT3 MCHP_PINMUX(c, 3, a, periph)

/* pc3d_sercom0_pad3 */
#define PC3D_SERCOM0_PAD3 MCHP_PINMUX(c, 3, d, periph)

/* pc3f_tcc0_wo3 */
#define PC3F_TCC0_WO3 MCHP_PINMUX(c, 3, f, periph)

/* pc3j_spi_ixs0_sdo */
#define PC3J_SPI_IXS0_SDO MCHP_PINMUX(c, 3, j, periph)

/* pc3m_gclk_io7 */
#define PC3M_GCLK_IO7 MCHP_PINMUX(c, 3, m, periph)

/* pc3p_ptc_eci1 */
#define PC3P_PTC_ECI1 MCHP_PINMUX(c, 3, p, periph)

/* pc4_gpio */
#define PC4_GPIO MCHP_PINMUX(c, 4, gpio, gpio)

/* pc4a_eic_extint4 */
#define PC4A_EIC_EXTINT4 MCHP_PINMUX(c, 4, a, periph)

/* pc4d_sercom1_pad0 */
#define PC4D_SERCOM1_PAD0 MCHP_PINMUX(c, 4, d, periph)

/* pc4f_tcc0_wo4 */
#define PC4F_TCC0_WO4 MCHP_PINMUX(c, 4, f, periph)

/* pc4h_can0_rx */
#define PC4H_CAN0_RX MCHP_PINMUX(c, 4, h, periph)

/* pc4j_spi_ixs0_mclk0 */
#define PC4J_SPI_IXS0_MCLK0 MCHP_PINMUX(c, 4, j, periph)

/* pc5_gpio */
#define PC5_GPIO MCHP_PINMUX(c, 5, gpio, gpio)

/* pc5a_eic_extint5 */
#define PC5A_EIC_EXTINT5 MCHP_PINMUX(c, 5, a, periph)

/* pc5d_sercom1_pad1 */
#define PC5D_SERCOM1_PAD1 MCHP_PINMUX(c, 5, d, periph)

/* pc5f_tcc0_wo5 */
#define PC5F_TCC0_WO5 MCHP_PINMUX(c, 5, f, periph)

/* pc5h_can0_tx */
#define PC5H_CAN0_TX MCHP_PINMUX(c, 5, h, periph)

/* pc5k_eth_tsucomp */
#define PC5K_ETH_TSUCOMP MCHP_PINMUX(c, 5, k, periph)

/* pc6_gpio */
#define PC6_GPIO MCHP_PINMUX(c, 6, gpio, gpio)

/* pc6a_eic_extint6 */
#define PC6A_EIC_EXTINT6 MCHP_PINMUX(c, 6, a, periph)

/* pc6b_ac_cmp1 */
#define PC6B_AC_CMP1 MCHP_PINMUX(c, 6, b, periph)

/* pc6d_sercom1_pad2 */
#define PC6D_SERCOM1_PAD2 MCHP_PINMUX(c, 6, d, periph)

/* pc6f_tcc0_wo6 */
#define PC6F_TCC0_WO6 MCHP_PINMUX(c, 6, f, periph)

/* pc6h_can1_rx */
#define PC6H_CAN1_RX MCHP_PINMUX(c, 6, h, periph)

/* pc7_gpio */
#define PC7_GPIO MCHP_PINMUX(c, 7, gpio, gpio)

/* pc7a_eic_extint7 */
#define PC7A_EIC_EXTINT7 MCHP_PINMUX(c, 7, a, periph)

/* pc7b_ac_cmp0 */
#define PC7B_AC_CMP0 MCHP_PINMUX(c, 7, b, periph)

/* pc7d_sercom1_pad3 */
#define PC7D_SERCOM1_PAD3 MCHP_PINMUX(c, 7, d, periph)

/* pc7f_tcc0_wo7 */
#define PC7F_TCC0_WO7 MCHP_PINMUX(c, 7, f, periph)

/* pc7h_can1_tx */
#define PC7H_CAN1_TX MCHP_PINMUX(c, 7, h, periph)

/* pc8_gpio */
#define PC8_GPIO MCHP_PINMUX(c, 8, gpio, gpio)

/* pc8a_eic_extint8 */
#define PC8A_EIC_EXTINT8 MCHP_PINMUX(c, 8, a, periph)

/* pc8d_sercom2_pad0 */
#define PC8D_SERCOM2_PAD0 MCHP_PINMUX(c, 8, d, periph)

/* pc8f_tcc5_wo0 */
#define PC8F_TCC5_WO0 MCHP_PINMUX(c, 8, f, periph)

/* pc8h_sqi0_clk */
#define PC8H_SQI0_CLK MCHP_PINMUX(c, 8, h, periph)

/* pc8i_sdmmc0_sdck */
#define PC8I_SDMMC0_SDCK MCHP_PINMUX(c, 8, i, periph)

/* pc9_gpio */
#define PC9_GPIO MCHP_PINMUX(c, 9, gpio, gpio)

/* pc9a_eic_extint9 */
#define PC9A_EIC_EXTINT9 MCHP_PINMUX(c, 9, a, periph)

/* pc9d_sercom2_pad1 */
#define PC9D_SERCOM2_PAD1 MCHP_PINMUX(c, 9, d, periph)

/* pc9f_tcc5_wo1 */
#define PC9F_TCC5_WO1 MCHP_PINMUX(c, 9, f, periph)

/* pc9h_sqi0_data0 */
#define PC9H_SQI0_DATA0 MCHP_PINMUX(c, 9, h, periph)

